DataProcessors/ГотовностьКПереходу26.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ГотовностьКПереходу26</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РаспоряженияНаОтгрузкуИВозвратКВыполнению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РаспоряженияНаОтгрузкуИВозвратКВыполнению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СостояниеЗаказано</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКОформлению</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКОтгрузке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЗаявленоНаВозврат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКОформлениюПоВозвратам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКПриемке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКПереходуПраваСобственности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКОформлениюСчетовФактур</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеОформленияДокументовПоРаспоряжению</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПервичныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровКлиенту</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ГотовностьКПереходу26/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признак использования устаревшей функциональности при проверке вывода уведомления.
//
// Возвращаемое значение:
//  Булево - признак использования устаревшей функциональности в системе.
//
Функция ПроверитьИспользованиеУстаревшейФункциональности() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ИспользуетсяУстаревшаяФункциональностьВСистеме = Ложь;
	Иначе
	
		ИспользуетсяУстаревшаяФункциональностьВСистеме = ИспользуетсяУстаревшаяФункциональность();
			
		Если НЕ ИспользуетсяУстаревшаяФункциональностьВСистеме Тогда
			УстановитьКонстантуУведомленияОбУстаревшейФункциональности(Ложь);
		КонецЕсли;
		
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат ИспользуетсяУстаревшаяФункциональностьВСистеме;

КонецФункции

// Возвращает признак использования устаревшей функциональности в привелигированном режиме.
//
// Возвращаемое значение:
//  Булево - признак использования устаревшей функциональности в системе.
//
Функция ИспользуетсяУстаревшаяФункциональность() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользуетсяУстаревшаяФункциональность = Ложь
		
		
		
		ИЛИ ШагКомиссионныеПродажиИспользуетсяУстаревшаяФункциональность()
		ИЛИ ШагЦенообразованиеИспользуетсяУстаревшаяФункциональность()
		ИЛИ ШагВзаиморасчетыИспользуетсяУстаревшаяФункциональность()
		
		//++ Локализация
		ИЛИ ШагПартионныйУчетИспользуетсяУстаревшаяФункциональность()
		//-- Локализация
		
		ИЛИ ШагRLSИспользуетсяУстаревшаяФункциональность();
		
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат ИспользуетсяУстаревшаяФункциональность;

КонецФункции

// Возвращает таблицу значений с устаревшей функциональностью.
//
// Параметры:
// 	РассчитыватьСостояние - Булево
// 	
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Идентификатор - Число
//   * УстаревшаяФункциональность - Строка
//   * НоваяФункциональность - Строка
//   * Статус - Число
//   * Состояние - Строка
//   * Рекомендация - Строка
//   * Действие - Строка
//   * РежимДействия - Число
//   * ИспользуетсяУстаревшаяФункциональность - Булево
//   * ИспользуетсяНоваяФункциональность - Булево
//   * РекомендацияТребующаяДействий - Булево
//   * ИнформацияНеПрипятствующаяОбновлению - Булево
//   * ДатаДокумента - Дата
//   * ТребуетсяРассчитатьСостояние - Булево
//
Функция ТаблицаУстаревшейФункциональности(РассчитыватьСостояние) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаЧисло(2));
	Таблица.Колонки.Добавить("УстаревшаяФункциональность", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Таблица.Колонки.Добавить("НоваяФункциональность", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Таблица.Колонки.Добавить("Статус", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	Таблица.Колонки.Добавить("Состояние", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Таблица.Колонки.Добавить("Рекомендация", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("Действие", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Таблица.Колонки.Добавить("РежимДействия", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	Таблица.Колонки.Добавить("ИспользуетсяУстаревшаяФункциональность", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ИспользуетсяНоваяФункциональность", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("РекомендацияТребующаяДействий", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ИнформацияНеПрипятствующаяОбновлению", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ДатаДокумента", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Таблица.Колонки.Добавить("ТребуетсяРассчитатьСостояние", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ЕстьДанныеПоУстаревшейФункциональности", Новый ОписаниеТипов("Булево"));
	
	
	
	
	
	ДобавитьШагКомиссионныеПродажи(Таблица, РассчитыватьСостояние);
	ДобавитьШагЦенообразование(Таблица, РассчитыватьСостояние);
	ДобавитьШагВзаиморасчеты(Таблица, РассчитыватьСостояние);
	
	//++ Локализация
	ДобавитьШагПартионныйУчет(Таблица, РассчитыватьСостояние);
	//-- Локализация
	
	
	ДобавитьШагВводОстатков(Таблица, РассчитыватьСостояние);
	ДобавитьШагRLS(Таблица, РассчитыватьСостояние);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Таблица;

КонецФункции

// Получение данных в длительной операции.
//
// Параметры:
// 	Параметры - Структура
// 	АдресХранилища - Строка
//
Процедура ПолучитьДанныеУстаревшейФункциональностиВФоне(Параметры, АдресХранилища) Экспорт
	
	ТаблицаДанных = ТаблицаУстаревшейФункциональности(Истина);
	
	ПоместитьВоВременноеХранилище(ТаблицаДанных, АдресХранилища);
	
КонецПроцедуры

// Устанавливает значение константы для показа формы уведомления об устаревшей функциональности.
//
// Параметры:
//  Значение - Булево - устанавливаемое значение.
//
Процедура УстановитьКонстантуУведомленияОбУстаревшейФункциональности(Значение) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	Иначе
		Константы.УведомитьОбУстаревшейФункциональности.Установить(Значение);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РежимДействияПереходКПомощнику()

	Возврат 1;

КонецФункции

Функция РежимДействияПереходВРаздел()

	Возврат 2;

КонецФункции

Функция РежимДействияПереходВСписокДокументов()

	Возврат 3;

КонецФункции

Функция РежимДействияПереходКНастройке()

	Возврат 4;

КонецФункции

Функция КартинкаИнформация()

	Возврат 2;	

КонецФункции

Функция КартинкаГотово()

	Возврат 0;	

КонецФункции

Функция КартинкаТребуетсяВнимание()

	Возврат 1;

КонецФункции

Функция КартинкаНеИспользуется()

	Возврат 3;	

КонецФункции

Процедура ЗаполнитьДанныеВСтроке(Строка)
	
	ИспользуетсяТолькоНоваяФункциональность = НЕ Строка.ИспользуетсяУстаревшаяФункциональность И Строка.ИспользуетсяНоваяФункциональность;
	ФункциональностьНеИспользуется = НЕ Строка.ИспользуетсяУстаревшаяФункциональность И НЕ Строка.ИспользуетсяНоваяФункциональность;
	ЕстьДанныеПоУстаревшейФункциональности = Строка.ЕстьДанныеПоУстаревшейФункциональности;
	
	#Область Состояние
	МожноПерейтиНа26 = Строка.ИнформацияНеПрипятствующаяОбновлению ИЛИ ИспользуетсяТолькоНоваяФункциональность ИЛИ ФункциональностьНеИспользуется;
		
	Если МожноПерейтиНа26 Тогда
		ТекстСостояния = НСтр("ru = 'Можно переходить на редакцию 11.6'");
	Иначе
		ТекстСостояния = НСтр("ru = 'Нельзя переходить на редакцию 11.6'");
	КонецЕсли;
	
	Если Строка.ТребуетсяРассчитатьСостояние Тогда
		ТекстСостояния = НСтр("ru = 'Рассчитывается'");
	КонецЕсли;
	
	Строка.Состояние = ТекстСостояния;
	#КонецОбласти
	
	#Область Рекомендация
	Рекомендация = Строка.Рекомендация;
	
	Если Не Строка.ТребуетсяРассчитатьСостояние Тогда
	
		Если ИспользуетсяТолькоНоваяФункциональность
		 ИЛИ ФункциональностьНеИспользуется Тогда
			Рекомендация = НСтр("ru = 'Дополнительных действий не требуется.'");
		ИначеЕсли Строка.РежимДействия = РежимДействияПереходКПомощнику() Тогда
			Рекомендация = НСтр("ru = 'Воспользуйтесь помощником перехода.'");
		КонецЕсли;
	
	КонецЕсли;
	
	Строка.Рекомендация = Рекомендация;
	#КонецОбласти
	
	#Область СтатусКартинка
	Если ФункциональностьНеИспользуется И ЕстьДанныеПоУстаревшейФункциональности Тогда
		Строка.Статус = КартинкаГотово();
	ИначеЕсли ФункциональностьНеИспользуется И НЕ ЕстьДанныеПоУстаревшейФункциональности Тогда
		Строка.Статус = КартинкаНеИспользуется();
	ИначеЕсли Строка.ИнформацияНеПрипятствующаяОбновлению И НЕ ИспользуетсяТолькоНоваяФункциональность Тогда
		Строка.Статус = КартинкаИнформация();
	ИначеЕсли ИспользуетсяТолькоНоваяФункциональность Тогда
		Строка.Статус = КартинкаГотово();
	Иначе
		Строка.Статус = КартинкаТребуетсяВнимание();
	КонецЕсли;
	#КонецОбласти
	
	#Область Действие
	Если Не Строка.ТребуетсяРассчитатьСостояние Тогда
	
		Если ИспользуетсяТолькоНоваяФункциональность ИЛИ ФункциональностьНеИспользуется Тогда
			ТекстДействия = "";
		ИначеЕсли Строка.РежимДействия = РежимДействияПереходКПомощнику() Тогда
			ТекстДействия = НСтр("ru = 'Помощник перехода'");
		ИначеЕсли Строка.РежимДействия = РежимДействияПереходВСписокДокументов() Тогда
			ТекстДействия = НСтр("ru = 'Переход к списку документов'");
		ИначеЕсли Строка.РежимДействия = РежимДействияПереходВРаздел() Тогда
			ТекстДействия = НСтр("ru = 'Переход к разделу администрирования'");
		ИначеЕсли Строка.РежимДействия = РежимДействияПереходКНастройке() Тогда
			ТекстДействия = НСтр("ru = 'Переход к настройке'");
		КонецЕсли;
	
	КонецЕсли;
	
	Строка.Действие = ТекстДействия;
	#КонецОбласти
	
	#Область РекомендацияТребующаяДействий
	Если ИспользуетсяТолькоНоваяФункциональность ИЛИ ФункциональностьНеИспользуется Тогда
		Строка.РекомендацияТребующаяДействий = Ложь;
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры



#Область КомиссионныеПродажи

Процедура ДобавитьШагКомиссионныеПродажи(Таблица, РассчитыватьСостояние)
	
	Строка = Таблица.Добавить();
	Строка.Идентификатор = ШагКомиссионныеПродажиИдентификатор();
	Строка.УстаревшаяФункциональность = НСтр("ru = 'Комиссионные продажи, версия 11.0'");
	Строка.НоваяФункциональность = НСтр("ru = 'Комиссионные продажи, версия 11.5'");
	Строка.РекомендацияТребующаяДействий = Истина;
	Строка.РежимДействия = РежимДействияПереходВСписокДокументов();
	
	Строка.ТребуетсяРассчитатьСостояние = НЕ РассчитыватьСостояние;
	Если РассчитыватьСостояние Тогда
	
		Строка.ИспользуетсяУстаревшаяФункциональность = ШагКомиссионныеПродажиИспользуетсяУстаревшаяФункциональность();
		Строка.ИспользуетсяНоваяФункциональность = ШагКомиссионныеПродажиИспользуетсяНоваяФункциональность();
		Строка.ДатаДокумента = ШагКомиссионныеПродажиДатаПоследнегоДокумента();
		Строка.ЕстьДанныеПоУстаревшейФункциональности = ЗначениеЗаполнено(Строка.ДатаДокумента);
	
	КонецЕсли;
	
	Строка.Рекомендация = НСтр("ru = 'Для перехода на функциональность ""Комиссионные продажи, версия 11.5"" необходимо выполнить следующие шаги:
		|1. Создать новые договоры передачи на комиссию с указанием в них версии 11.5 (использование договоров обязательно). Создать новые соглашения, если используются.
		|2. Недооформленные документы (отчеты комиссионеров) в рамках соглашений и договоров версии 11.0 - дооформить по версии 11.0.
		|3. Для остающихся товаров оформить возвраты по версии комиссии 11.0  и последующую передачу по версии 11.5.
		|4. В настройках комиссионных продаж выбрать версию 11.5 взамен 11.0/11.5.'");
	
	
	ЗаполнитьДанныеВСтроке(Строка);

КонецПроцедуры

Функция ШагКомиссионныеПродажиИдентификатор() Экспорт

	Возврат 5;

КонецФункции

Функция ШагКомиссионныеПродажиИспользуетсяУстаревшаяФункциональность()
	
	ЗначениеОпций = ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриПродажах") И ПолучитьФункциональнуюОпцию("ВыбиратьВерсиюКомиссионныхПродаж");
	
	Если ЗначениеОпций Тогда
		Возврат Истина;
	Иначе
		Возврат ШагКомиссионныеПродажиЕстьОстаткиВФинансовомУчете();
	КонецЕсли;
	
КонецФункции

Функция ШагКомиссионныеПродажиИспользуетсяНоваяФункциональность()

	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриПродажах") И НЕ ПолучитьФункциональнуюОпцию("ВыбиратьВерсиюКомиссионныхПродаж");

КонецФункции

Функция ШагКомиссионныеПродажиДатаПоследнегоДокумента()
	
	Дата = Дата(1, 1, 1); 
	
	Запрос = Новый Запрос(ШагКомиссионныеПродажиТекстЗапросаДатаПоследнегоДокумента());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Дата = Выборка.ДатаДокумента;
	КонецЕсли;
	
	Возврат Дата;

КонецФункции

Функция ШагКомиссионныеПродажиТекстЗапросаДатаПоследнегоДокумента()

	Возврат 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Таблица.Дата) КАК ДатаДокумента
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ТоварыПереданные.Период) КАК Дата
	|	ИЗ
	|		РегистрНакопления.ТоварыПереданныеНаКомиссию КАК ТоварыПереданные
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МАКСИМУМ(Распоряжения.Дата)
	|	ИЗ
	|		Документ.ЗаказКлиента КАК Распоряжения
	|	ГДЕ
	|		Распоряжения.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|		И Распоряжения.Проведен
	|		И НЕ ЕСТЬNULL(Распоряжения.Договор.КомиссионныеПродажи25, ЛОЖЬ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МАКСИМУМ(Распоряжения.Дата)
	|	ИЗ
	|		Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК Распоряжения
	|	ГДЕ
	|		Распоряжения.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|		И Распоряжения.Проведен
	|		И НЕ ЕСТЬNULL(Распоряжения.Договор.КомиссионныеПродажи25, ЛОЖЬ)) КАК Таблица";

КонецФункции

Функция ШагКомиссионныеПродажиЕстьОстаткиВФинансовомУчете()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Распоряжения.Распоряжение КАК Распоряжение
		|ИЗ
		|	РегистрСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению КАК Распоряжения
		|ГДЕ
		|	Распоряжения.СостояниеКОформлению <> ЗНАЧЕНИЕ(Перечисление.СостояниеОформленияДокументовПоРаспоряжению.Оформлены)
		|	И Распоряжения.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
		|	И НЕ ЕСТЬNULL(Распоряжения.Распоряжение.Договор.КомиссионныеПродажи25, ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыПереданные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		|	ТоварыПереданные.Соглашение КАК Соглашение,
		|	ТоварыПереданные.Организация КАК Организация,
		|	ТоварыПереданные.ВидЗапасов КАК ВидЗапасов,
		|	ТоварыПереданные.НомерГТД КАК НомерГТД,
		|	ТоварыПереданные.КоличествоОстаток КАК КоличествоОстаток,
		|	ТоварыПереданные.КоличествоПоРНПТОстаток КАК КоличествоПоРНПТОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки(, ) КАК ТоварыПереданные
		|ГДЕ
		|	(ТоварыПереданные.КоличествоОстаток <> 0
		|			ИЛИ ТоварыПереданные.КоличествоПоРНПТОстаток <> 0)";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	Возврат НЕ МассивРезультатов[0].Пустой() ИЛИ НЕ МассивРезультатов[1].Пустой();

КонецФункции

#КонецОбласти

#Область Ценообразование

Процедура ДобавитьШагЦенообразование(Таблица, РассчитыватьСостояние)
	
	Строка = Таблица.Добавить();
	Строка.Идентификатор = ШагЦенообразованиеИдентификатор();
	Строка.УстаревшаяФункциональность = НСтр("ru = 'Ценообразование, версия 11.0'");
	Строка.НоваяФункциональность = НСтр("ru = 'Ценообразование, версия 11.5'");
	Строка.РежимДействия = РежимДействияПереходКПомощнику();
	
	Строка.ТребуетсяРассчитатьСостояние = НЕ РассчитыватьСостояние;
	Если РассчитыватьСостояние Тогда
	
		Строка.ИспользуетсяУстаревшаяФункциональность = ШагЦенообразованиеИспользуетсяУстаревшаяФункциональность();
		Строка.ИспользуетсяНоваяФункциональность = ШагЦенообразованиеИспользуетсяНоваяФункциональность();
		Строка.ДатаДокумента = ШагЦенообразованиеДатаПоследнегоДокумента();
		Строка.ЕстьДанныеПоУстаревшейФункциональности = ЗначениеЗаполнено(Строка.ДатаДокумента);
	
	КонецЕсли;
	
	Строка.Рекомендация = НСтр("ru = 'Воспользуйтесь помощником перехода.'");
	
	
	ЗаполнитьДанныеВСтроке(Строка);

КонецПроцедуры

Функция ШагЦенообразованиеИдентификатор() Экспорт

	Возврат 6;

КонецФункции

Функция ШагЦенообразованиеИспользуетсяУстаревшаяФункциональность()

	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовЦен") И ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование20");

КонецФункции

Функция ШагЦенообразованиеИспользуетсяНоваяФункциональность()

	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовЦен") И ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25");

КонецФункции

Функция ШагЦенообразованиеДатаПоследнегоДокумента()
	
	Дата = Дата(1, 1, 1); 
	
	Запрос = Новый Запрос(ШагЦенообразованиеТекстЗапросаДатаПоследнегоДокумента());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Дата = Выборка.ДатаДокумента;
	КонецЕсли;
	
	Возврат Дата;

КонецФункции

Функция ШагЦенообразованиеТекстЗапросаДатаПоследнегоДокумента()

	Возврат 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Период) КАК ДатаДокумента
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры";

КонецФункции
	
#КонецОбласти

#Область Взаиморасчеты

Процедура ДобавитьШагВзаиморасчеты(Таблица, РассчитыватьСостояние)
	
	Строка = Таблица.Добавить();
	Строка.Идентификатор = ШагВзаиморасчетыИдентификатор();
	Строка.УстаревшаяФункциональность = НСтр("ru = '""Старая"" архитектура взаиморасчетов (""оффлайн"")'");
	Строка.НоваяФункциональность = НСтр("ru = '""Новая"" архитектура взаиморасчетов (""онлайн"")'");
	Строка.РежимДействия = РежимДействияПереходВРаздел();
	
	Строка.ТребуетсяРассчитатьСостояние = НЕ РассчитыватьСостояние;
	Если РассчитыватьСостояние Тогда
	
		Строка.ИспользуетсяУстаревшаяФункциональность = ШагВзаиморасчетыИспользуетсяУстаревшаяФункциональность();
		Строка.ИспользуетсяНоваяФункциональность = ШагВзаиморасчетыИспользуетсяНоваяФункциональность();
	
	КонецЕсли;
	
	Строка.Рекомендация = НСтр("ru = 'Для перехода на новую функциональность необходимо переключить функциональную опцию.'");
	
	ЗаполнитьДанныеВСтроке(Строка);

КонецПроцедуры

Функция ШагВзаиморасчетыИдентификатор() Экспорт

	Возврат 7;

КонецФункции

Функция ШагВзаиморасчетыИспользуетсяУстаревшаяФункциональность()

	Возврат НЕ ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");

КонецФункции

Функция ШагВзаиморасчетыИспользуетсяНоваяФункциональность()

	Возврат ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");

КонецФункции

#КонецОбласти

//++ Локализация

#Область ПартионныйУчет

Процедура ДобавитьШагПартионныйУчет(Таблица, РассчитыватьСостояние)
	
	Строка = Таблица.Добавить();
	Строка.Идентификатор = ШагПартионныйУчетИдентификатор();
	Строка.УстаревшаяФункциональность = НСтр("ru = 'Партионный учет, версия 2.1'");
	Строка.НоваяФункциональность = НСтр("ru = 'Партионный учет, версия 2.2'");
	Строка.РекомендацияТребующаяДействий = Истина;
	Строка.РежимДействия = РежимДействияПереходВРаздел();
	
	Строка.ТребуетсяРассчитатьСостояние = НЕ РассчитыватьСостояние;
	Если РассчитыватьСостояние Тогда
	
		Строка.ИспользуетсяУстаревшаяФункциональность = ШагПартионныйУчетИспользуетсяУстаревшаяФункциональность();
		Строка.ИспользуетсяНоваяФункциональность = ШагПартионныйУчетИспользуетсяНоваяФункциональность();
		Строка.ДатаДокумента = ШагПартионныйУчетДатаПоследнегоДокумента();
		Строка.ЕстьДанныеПоУстаревшейФункциональности = ЗначениеЗаполнено(Строка.ДатаДокумента);
	
	КонецЕсли;
	
	Строка.Рекомендация = НСтр("ru = 'Для перехода на функциональность ""Партионный учет, версия 2.2"" необходимо в настройках системы указать версию 2.2 для партионного учета и задать дату (должна быть началом месяца), начиная с которой будет действовать новая настройка.'");
	
	ЗаполнитьДанныеВСтроке(Строка);

КонецПроцедуры

Функция ШагПартионныйУчетИдентификатор() Экспорт

	Возврат 8;

КонецФункции

Функция ШагПартионныйУчетИспользуетсяУстаревшаяФункциональность()

	Возврат РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии21();

КонецФункции

Функция ШагПартионныйУчетИспользуетсяНоваяФункциональность()

	Возврат РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22();

КонецФункции

Функция ШагПартионныйУчетДатаПоследнегоДокумента()
	
	Дата = Дата(1, 1, 1); 
	
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22() Тогда

		Дата = РасчетСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22();
		
		Если ЗначениеЗаполнено(Дата) И РасчетСебестоимостиПовтИсп.ИспользовалсяПартионныйУчетДоПереходаНаВерсию22(Дата-1) = Истина Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Дата", Дата);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МАКСИМУМ(Т.Период) КАК Период
			|ИЗ
			|	(ВЫБРАТЬ
			|		МАКСИМУМ(Т.Период) КАК Период
			|	ИЗ
			|		РегистрНакопления.ПартииТоваровОрганизаций КАК Т
			|ГДЕ
			|	Т.Период < &Дата
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		МАКСИМУМ(Т.Период)
			|	ИЗ
			|		РегистрНакопления.СебестоимостьТоваров КАК Т
			|ГДЕ
			|	Т.Период < &Дата
			|	) КАК Т";

			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Дата = Выборка.Период;
			КонецЕсли;
			
		Иначе
			Дата = Дата(1, 1, 1); 
		КонецЕсли;
		
	ИначеЕсли РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии21() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(Т.Период) КАК Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(Т.Период) КАК Период
		|	ИЗ
		|		РегистрНакопления.ПартииТоваровОрганизаций КАК Т
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		МАКСИМУМ(Т.Период)
		|	ИЗ
		|		РегистрНакопления.СебестоимостьТоваров КАК Т) КАК Т";

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Дата = Выборка.Период;
		КонецЕсли;

	КонецЕсли;
	
	Возврат Дата;

КонецФункции

#КонецОбласти

//-- Локализация

#Область ВводОстатков

Процедура ДобавитьШагВводОстатков(Таблица, РассчитыватьСостояние)
	
	Строка = Таблица.Добавить();
	Строка.Идентификатор = ШагВводОстатковИдентификатор();
	Строка.УстаревшаяФункциональность = НСтр("ru = 'Единый документ ""Ввод остатков""'");
	Строка.НоваяФункциональность = НСтр("ru = 'Раздельные документы ""Ввод остатков""'");
	Строка.ИспользуетсяУстаревшаяФункциональность = Ложь;
	Строка.ИспользуетсяНоваяФункциональность = Ложь;
	Строка.ИнформацияНеПрипятствующаяОбновлению = Истина;
	Строка.ТребуетсяРассчитатьСостояние = НЕ РассчитыватьСостояние;
	
	Строка.Рекомендация = НСтр("ru = 'Дополнительных действий не требуется.'");
	
	ЗаполнитьДанныеВСтроке(Строка);

КонецПроцедуры

Функция ШагВводОстатковИдентификатор() Экспорт

	Возврат 12;

КонецФункции

#КонецОбласти

#Область RLS

Процедура ДобавитьШагRLS(Таблица, РассчитыватьСостояние)
	
	Строка = Таблица.Добавить();
	Строка.Идентификатор = ШагRLSИдентификатор();
	Строка.УстаревшаяФункциональность = НСтр("ru = '""Стандартный"" RLS'");
	Строка.НоваяФункциональность = НСтр("ru = '""Производительный"" RLS'");
	Строка.ИнформацияНеПрипятствующаяОбновлению = Истина;
	Строка.РежимДействия = РежимДействияПереходВРаздел();
	
	Строка.ТребуетсяРассчитатьСостояние = НЕ РассчитыватьСостояние;
	Если РассчитыватьСостояние Тогда
	
		Строка.ИспользуетсяУстаревшаяФункциональность = ШагRLSИспользуетсяУстаревшаяФункциональность();
		Строка.ИспользуетсяНоваяФункциональность = ШагRLSИспользуетсяНоваяФункциональность();
	
	КонецЕсли;
	
	Строка.Рекомендация = НСтр("ru = 'Рекомендуется заранее выполнить переход на ""Производительный"" режим RLS в редакции 11.5. В редакции 11.6 переход будет принудительным.'");
	
	
	ЗаполнитьДанныеВСтроке(Строка);

КонецПроцедуры

Функция ШагRLSИдентификатор() Экспорт

	Возврат 13;

КонецФункции

Функция ШагRLSИспользуетсяУстаревшаяФункциональность()

	Возврат ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей") И НЕ ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписейУниверсально");

КонецФункции

Функция ШагRLSИспользуетсяНоваяФункциональность()

	Возврат ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей") И ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписейУниверсально");

КонецФункции
	
#КонецОбласти

#КонецОбласти

#КонецЕсли
